■■■■■■■■■■■■■■■■■■■■■■■■■■ これからよろしく
大阪技術部グループ 2 の皆さん

柴田です。

▼ 挨拶
先日の部会、お疲れ様でした。

部会に出るということ、何かの縁で他者同士が同じ組織に属すことになった状況を、
有意義に活用する方法はないか、みなさんと考えていけたらと思います。

これからもよろしくお願いいたします。

▼ 情報共有
このメールは、グループのメーリングリストで送られています。
なにか共有したいことがある場合など、ご利用ください。

思い悩んでいることなどありましたら、話を聞きます。柴田の携帯までどうぞ。
柴田個人携帯：09044971316
メールでもいいです。


■■■■■■■■■■■■■■■■■■■■■■■■■■ ファイル記入してね

大阪技術部グループ 2 の皆さん

下期の査定評価をするにあたり、添付ファイルへの記載をお願いいたします。

▼ 対象者
入社時期が当年7月末入社までの方

▼ 添付ファイル
2018年度_下半期_面談結果(大阪営業所Gr2_〇〇 〇〇).xls
※ 〇〇 〇〇 の部分に名前を記載

▼ ファイル提出期限
11月2日

▼ 記入方法
氏名：自分の名前
下半期評価者：面談後記入
評価項目：本人欄(Z列)に実績値＊ウェイトの値を記入
　　　　　※ 基準、実績値に記載されている内容を参考にしてください。
　　　　　理由欄(AC列)に理由を入力

面談日及び面談方法等については、改めて連絡いたします。
-------------------------------------------------


■■■■■■■■■■■■■■■■■■■■■■■■■■ 面談方法展開
大阪技術部グループ 2 の皆さん

お疲れ様です。柴田です。

面談を以下の通りに実施いたします。
質問する内容も展開しますので、参考にしてください。

▼ 対象者
全員

▼ 面談方法
電話、Line、Google Hangout など

▼ 面談候補日
11月1日～11月10日まで
平日:夜20時以降
土日:いつでも

▼ 面談スケジュールの決め方
Google カレンダーの希望日時に「面談希望」などのタイトルで記載いただき、
その他のオプション > ゲストを追加 で柴田を検索し、ゲストとして登録してください。

▼ 面談予定時間
30分程度

▼ 質問シート
面接時質問内容.zip








面接時質問内容 については、
事前展開を検討
・評価者のコメントは、「あ、そう」で終わりそうなものもあるので、
列を消しておく？
・後日展開する？
・いつでも書いてね、てやってみる？※ぐだぐだになるかも








大阪の技術部の皆様

上期査定評価を行います。
面談までにあまり時間がないなかでの連絡となり、申し訳ありません。協力よろしくお願いします。

面談方法は別途メールします。

添付ファイルを記入して、6月12日までに水谷マネージャ、片山さん、丸山に返信ください。

1月1日までに入社された方はすべて記入
上記以降に入社されたかたは下期目標のみ記入でお願いします。
ファイル名の○○Grは大阪営業所Gr

記入方法
氏名：自分の名前
下半期評価者：面談後記入
評価項目：本人欄に実績値＊ウェイトの値を入力
　　　　　基準、実績値に記載されている内容を参考にしてください。
　　　　　理由欄に理由を入力(勤怠状況の理由はそのまま)
　　　　　そのほか別途アピールしたい項目がある人は、
　　　　　右下の空きスペースに記入
下期目標：下期の目標を入力
　⇒特にない人には資格を推奨しておりますが、
　自分の努力外のもの、判断に困るものはそこを明確化したものを
　設定するようお願いします。
　(例；開発の現場にいけるようにする
　　⇒営業努力の側面も大きくなる為、開発の現場にいけるよう
　　何をするかに置き換えてそこの達成度を計る)
要件：目標を達成するために、どのような方法で行うかを記入

そのほか、評価シートとは別にどう成長していきたいか、それを実現するためにどうして行くか(キャリアプラン)をお話できればとおもいますので、考えておいてください。

添付ファイルのパスワードはws共通パスです。

以上、よろしくお願いします。
-------------------------------------------------


評価対象期間	上期：11月1日～5月31日　　下期：6月1日～10月31日
評価対象者	上期：今年1月1日入社まで　下期：当年7月末入社まで



■■■■■■■■■■■■■■■■■■■■■■■■■■
（重要）上期査定評価の面談お願い

大阪営業所
各位様

お早う御座います。片山です。
上期査定評価で連絡致します。

①面談について
丸山課長と相談しまして、下記の段取りで面談を
致します。19日迄に皆様の 上期査定を纏めないと
いけません。宜しくお願い致します。

●丸山さんチーム
16日（土）17日（日）の午前9時～午後20時の時間帯
で一人30分でSNS(LINE)で面談。都合が良い方は
会社のGoogleスケジュールに入れて下さい。
●片山チーム
13日～15日、18日の定時後18時～20時の時間帯で
大阪事務所で面談します。都合が良い方は会社のGoogle
スケジュールに入れて下さい。

② 上期査定評価シートがまだ出ていない方は、至急に
丸山さん、水谷マネージャ、片山にメールで出して下さい。
くれぐれも宜しくお願い致します。


大阪メンバー各位様で自分のスケジュールで
都合の 日程時間帯 （チーム  ）を選んで下さい。
丸山、片山でメンバーを決めませんので宜しく
お願いします。



現在6名のメンバーが面談日程決まっていないかと思います。
（添付参照）PWはWSパス
確認した方法は私と片山さんのgoogleカレンダーです。

まだ決まっていない方は私か片山さんGoogleカレンダーで空き時間を見て30分間でスケジュールいれてください。
平日希望者は片山さん、土日（9:00-20:00）希望者は丸山で対応します。
土日希望者は私の予定は気にせず、ご自身の都合の良い時間に入れていただければよいです。



-------------------------------------------------
客先評価：5　（4.8）
営業支援：4　（4.2）
社内活動：1　（1.0）
自己アピール：0（加点）
合計10＋自己アピール分

【期日】11月11日(土)

上野では、 面談をする中で キャリアプランも併せてヒアリングしていく予定です。
その分のフォーマットも格納されておりますので良ければご活用下さい
