■■■■■■■■■■■■■■■■■■■■■■■■■■ systemd とは
・Linuxの起動処理やシステム管理を行う仕組み
・シェルスクリプトでは無い
・すべてのプロセスの親プロセス
・サービスを1つのシェルスクリプトではなくUnitという単位で管理し、設定ファイルとして持つ
・cgroup によってプロセスを管理する
# ※ 下記の、■■■■■■■■■■■■ 2.コントロールグループ cgroups を参照
# C:\Users\Yasuaki\Dropbox\01.study\MyAws\30.勉強\03.ミドルウェア\031.Docker\03.Dockerとコンテナ.java

▼ init と違う点
・プロセスを並列にスタートできる
 →起動時間と処理のオーバーヘッドを削減できる

■■■■■■■■■■■■■■■■■■■■■■■■■■ Linuxの起動処理
1.電源投入によりBIOSが起動する。
2.BIOSからブートローダーが呼び出される。
3.ブートローダーがLinuxカーネルを起動する。
4.Linuxカーネルがinitプロセス(PID 1)を起動する。



■■■■■■■■■■■■■■■■■■■■■■■■■■ Initプロセス
・init デーモンは、Fedora, OpenSuSE, Arch, RHEL, CentOS, etc で systemd にリプレースされている
・initプロセスが、Linuxの起動処理を司る
・すべてのプロセスの親プロセス
・シリアルに開始する
・あるタスクは前のタスクの開始に成功したあとでのみスタートする
・起動してシャットダウンするまで走り続ける
