#!/bin/bash

https://qiita.com/zayarwinttun/items/0dae4cb66d8f4bd2a337

▼ はまった
-------------------------------------------------
・スペース問題
# if[$even = 1] →if [ $even = 1 ] それぞれスペースがないとエラー
-------------------------------------------------


▼ １ から ９９ の間の奇数を出力
-------------------------------------------------
for x in {1..99..2}
do
  echo $x
done
-------------------------------------------------

#!/bin/bash
for X in {1..99}
do
  even=$(expr $X % 2)
  # even=`expr $X % 2`
  if [ $even = 1 ]
  then
    echo $X
  fi
done
-------------------------------------------------

seq 1 2 99
-------------------------------------------------
