▼ なぜ異なる Python 環境をセットするか
-------------------------------------------------
・Python アプリをダウンロードしたときに、異なるバージョンのPythonにあわせるため
・プログラムのパーツの一部のバージョンが変わることで、互換性が保てなくなるよりは、ちゃんと動くバージョンの環境でパッケージするため
・共同作業をするメンバー間で環境を統一するため
・アプリをクライアントに渡す際に、クライアントのコンピュータでもちゃんと動くことを保証するため
-------------------------------------------------





▼ virtualenv について
-------------------------------------------------
パッケージを切り分ける仮想環境を作る人
異なるプロジェクトの依存関係を別々に保つのに役立つ

新しいプロジェクトごとにvirtualenvを作成することをお勧め

絶対にやってはいけないのはSystem Pythonを使い続けること
# System Pythonは往々にして古いことが多く、またyumなどシステム上重要なシステムに依存しています。
# うっかり、 sudo pip install などしようものなら、環境を壊してしまう恐れがあります。
-------------------------------------------------
