■■■■■■■■■■■■■■■■■■■■■■■■■■ 穴埋め
・短い句や文を作り、メンバーに空欄を埋めてもらう
・例）顧客「私は○○がほしい」(空欄を埋めよ)


■■■■■■■■■■■■■■■■■■■■■■■■■■ 「問いかけ」
・一般的で強力な発火のテクニック
・問いかけの組み立て方によって、一定の方向を示す探求のベクトルが決まる
・問題に対するメンバーの捉え方を変えられる
・掘り下げて根本の原因を明らかにする
・会話をより高い次元へ引き上げる

■■■■■■■■■■■■■■■■■■■■■■■■■■ 発火によって、結節点を作る
▼ 結節点とは
・ノード(結節点)は、より大きなシステムの部分を構成するもののこと

▼ 開幕の段階での第一の仕事
ゲームのコマとなる結節点を、できるだけ多く生み出すこと

■■■■■■■■■■■■■■■■■■■■■■■■■■ 空気づくり
・物議を醸しそうなアイデアを歓迎
・アイデアを組み合わせてよりよいものにする


■■■■■■■■■■■■■■■■■■■■■■■■■■ 開幕に関する問いかけ
・今直面している問題を定義するとしたら？
・どのようなことを探索したいですか？
・特に大きな問題点はなんですか？

■■■■■■■■■■■■■■■■■■■■■■■■■■ 舵取りに関する問いかけ
舵取り問いかけは乱発しないようにする
疑問を発しすぎると、メンバーが不安になる

・私達は順調に進んでいるでしょうか
・自分はこれを正しく理解できているでしょうか
・希望の場所へ到達する上で、これは役立っているでしょうか
・この議論の進め方は効果的ですか？
・これは今の所保留にしておいて、あとで議論する項目のリストに加えるべきでしょうか
・あのとき設定したゴールにはまだ意味があるでしょうか。それとも、これまでにわかったことをもとにいくらか調整をすべきでしょうか


■■■■■■■■■■■■■■■■■■■■■■■■■■ 調査に関する問いかけ
・観察と分析を引き出す
・調査対象を絞り込み、細部に焦点を当てる
・抽象的なアイデアを具体化できる

・これは何でできているでしょうか
・これはどう動作しますか
・構成要素は何ですか
・それはどんな様子のものですか
・その具体例を上げてもらえますか
・日常的な場面になぞらえてそのことを説明できますか

■■■■■■■■■■■■■■■■■■■■■■■■■■ 実験に関する問いかけ
・想像力を引き出す
・可能性を問う
・抽象の度合いを挙げて、他のものとの類似を見つける

・他に何がこのような働きをするでしょうか
・これが動物、植物、機械だとしたら、どんな種類の動物でしょうか？それはなぜでしょうか？
・何を見落としているのでしょうか
・障害が全部取り除かれたとしたら？
・もしも私達が間違っているとしたら？
・レストランを経営しているとしたら、これをどう扱うでしょうか？病院だったら？


■■■■■■■■■■■■■■■■■■■■■■■■■■ 閉幕に関する問いかけ
・態度の表明、決定、行動へと向かう
・見込みのない調査の路線を排除し、優先事項を決める
・たとえそれが単なるレポートや TODOリストだとしても

・こうした選択肢の優先順位はどのｙほうに決めることができるでしょうか
・何が実現可能でしょうか
・これから2周間で何ができますか
・これから誰が何をしますか？
