■■■■■■■■■■■■■■■■■■■■■■■■■■ はじめかた
「このやり方で今日はやってみませんか？」と一言かける。
難しい説明は不要。

■■■■■■■■■■■■■■■■■■■■■■■■■■ どうしたらゴールできるのか？
・究極の目的を全員が意識し、知恵を出し合い、助け合う

■■■■■■■■■■■■■■■■■■■■■■■■■■ 空気のコントロール
・リーダーは、イノベーションの障害を取り除き、精神的な支援を惜しまない
・成功シナリオの実行度合いを確認する
・うまくいった点、いかなかった点を全員で話し合う
・成果だけでなく、他人を助けたかどうかを含め、良い行動をした人を称賛する
・結果、どういう行動を各人が取ればよいのか、組織全体が学習する
・コントロールを手放し、プレイヤーを信頼し、対等に扱うこと

■■■■■■■■■■■■■■■■■■■■■■■■■■ ゲームとは
・日常生活のルールが一時的に通用されなくなり、
ゲームのルールがそれに取って代わる別の世界に入り込むということ

▼ 前提条件
・同意なくしてゲームなし
・プレイヤーとなるものが、その世界のルールに従うことに同意し、しかも喜んで入っていかなくてはならない
