■■■■■■■■■■■■■■■■■■■■■■■■■■ Lambda から SSM Run Command


■■■■■■■■■■■■■■■■■■■■■■■■■■ 一時的な作業は、作業用SGをアタッチする
・繰り返し使える
・作業ミスでルールを消したりしない
ELB-SG 0.0.0.0/0 443 を許可
Web-SG ELB-SG からの 80 を許可

■■■■■■■■■■■■■■■■■■■■■■■■■■ 1台でもAutoScalingGroup に入れる
障害時に自動復旧する
台数を増やしたくなったときに、簡単に増やせる

ログは fluentd 等でS3へ出す
S3 のログは S3 Select や Athena で検索
または、CloudWatch Agent →Logs
※ S3 のほうが安い

■■■■■■■■■■■■■■■■■■■■■■■■■■ これの監視がいい
TargetGroup
・ConsumedLCUs 負荷状況の確認
TargetResponseTime: バックエンドからのレスポンスタイム
HTTPCode_Target_5XX_COunt: サーバエラーのカウント


■■■■■■■■■■■■■■■■■■■■■■■■■■ 自動パッチ適用
前提：
ELB/AutoScaling 配下にEC2複数台

SSMエージェントインストール済み
-------------------------------------------------
▼ AutoScaling から1台インスタンスを選ぶ
メンテナンスウィンドウから実行
ターゲとをAutoScalingGroupに設定
スケジュール通りに開始
メンテナンスウィンドウから、インスタンス1つの情報をAutomation に渡す

▼ AutoScaling から切り離す (Standby)
Automationから CFNでLambdaを作成し、Lambda で切り離す

▼ パッチ適用
Run Command からパッチ適用
適用するベースラインは Patch Manager で定義されているものを利用

▼ インスタンスを戻す
Automation で CFN の Lambda を使って。。。
 →次のインスタンスに同じ処理を繰り返す

インスタンスがなくなるまで繰り返す


■■■■■■■■■■■■■■■■■■■■■■■■■■ セキュリティ運用自動化の進め方
▼ 自動化するための設計をしっかり行う
・検証環境、テスト手法、評価基準
・パッチベースラインの設定
・パッチ適用順序等の設計

▼ 設計しないで運用丸投げは、運用が苦労するので、設計ができたら自動化へ。
