■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ Yum
システム全体のパッケージをアップデート
yum update
-------------------------------------------------

そのファイルがどのパッケージからインストールされたかを調べる
yum provides ファイル名
-------------------------------------------------
インストールされているパッケージを調べる
yum list installed
-------------------------------------------------







■■■■■■■■■■■■■■■■■■■■■■■■■■  用語解説
#!/bin/bash -xe
-------------------------------------------------
ps や top を使用した際に、これがないと「test.sh」のように表示されず、
一律で「bash」見たく表示され、どのシェルなのかが特定できない。よってシェルスクリプトの最上段に記述すべし。
-------------------------------------------------












■■■■■■■■■■■■■■■■■■■■■■■■■■ シェル特殊変数
$?
// シェルが最後に実行したコマンドの終了状態を保持している。ほとんどのコマンドは成功時には「０」を返す
-------------------------------------------------



■■■■■■■■■■■■■■■■■■■■■■■■■■ シェルオプション
-eオプション
// 実行したコマンドが0でないステータスで終了した場合、即座に終了するオプション。
-x オプション
// シェルスクリプト内で実際に実行されたコマンドを表示するオプション。
// 変数が使用されている場合は、その変数の値が展開された状態で表示される。
-------------------------------------------------
