■■■■■■■■■■■■ ファイルとは
・テープやDVD,HD上に配置された情報の集まり。
・メディア上の音楽や映画など

■■■■■■■■■■■■ ファイルシステムとは
・ファイルを正しく格納する
・必要なときに必要なものを使用できるようにする
・DVD のディスクにラベルをつけて分類した仕組みも、ファイルシステムと言えないことはない
・HDなど、データを記録する装置で、どこにどんなファイルが記録されているか管理する仕組み

■■■■■■■■■■■■ Win/Mac におけるファイルシステムとは
・Windows では FAT16、FAT32、NTFS など
・Mac では HFS、HFS+ など

■■■■■■■■■■■■ データのフォーマットとは
・OSののファイルシステムに合わせて記憶領域を区切り、番号を設定すること。
・記録装置の中は、ファイルシステムの領域と、実際にデータを記録するクラスタ領域とにわかれる

■■■■■■■■■■■■ クラスタ領域
・データを保存するために、フォーマット時にディスクの中に作られた区画
・クラスタはファイルを保存するための最小単位
・どのクラスタにどのデータを記録したか、ファイルシステムで管理している
・HD 内のファイルを呼び出すときは、ファイルシステムが何番のクラスタにそれが保存されているかを確認し、データが読み出される
・HD のデータを削除しても、クラスタ領域のデータはそのまま、ファイルシステムの記録だけが消える

■■■■■■■■■■■■ ファイルシステムの機能
・ファイルの保存機能
・暗号化機能
・ファイルのアクセス許可設定
・圧縮機能
