

▼ Vim
-------------------------------------------------
%	括弧へ移動

w	単語の先頭に進む
b	単語の先頭に戻る
e	単語の末尾に進む
ge	単語の末尾に戻る

W	単語の先頭に進む
B	単語の先頭に戻る
E	単語の末尾に進む
gE	単語の末尾に戻る

ctrl + u	半画面分 上へ
ctrl + d	半画面分 下へ
ctrl + b	一画面分 上へ
ctrl + f	一画面分 下へ
{	段落毎に上へ
}	段落毎に下へ


g;	変更してきた箇所に戻る
g,	変更してきた箇所に進む

コピー// y





削除
単語 dw 3dw←3単語削除

行頭まで d$

:set number  ⇒行番号を表示

■大文字での移動と、小文字での移動都の違い
abc.def.ghi
小文字なら5単語 abc . def . ghi
大文字なら1単語 abc.def.ghi




0	行の先頭へ(インデント無視して先頭へ)
^	行の先頭へ
$	行の末尾へ
+	下の行の先頭へ
-	上の行の先頭へ

コマンド	移動内容

gg	そのファイルの先頭へ
G	そのファイルの末尾へ

ジャンプリストを辿る

ファイル内も移動できるけど、ファイル間の移動に便利。
直前に編集していたファイルに戻りたいとか。
今回の記事にはそぐわないかな。。
コマンド	移動内容
ctrl + o	ジャンプしてきた箇所に戻る
ctrl + i	ジャンプしてきた箇所に進む




:w !sudo tee %// ReadOnly で開いて編集したときも、保存可能
tee// 一つの出力を、特定のファイルと、標準出力両方に送る。上記コマンドは、標準出力は指定されていないので、出力されない。
// 上書きのためのハック的なやり方。
%// 現在のファイル

現在の位置から、次の foo までを選択//    /vfoo
保存して閉じる//   ZZ


-------------------------------------------------
