エンジニアがシステムに変更を加えやすいようにする。
要件の変更に伴う予期せぬユースケースに適応するため。
※ extensibility, modifiabilityy, plasticity とも言う

組織のプロセスの用語として、Agile は変化に適応するためのフレームワークを提供している。

Agile コミュニティはテクニカルなツールとパターンを開発して、TDDやリファクタリングなど、頻繁に変更がなされる環境でのソフトウェア開発に役立っている。
しかし、Agile 技術の殆どの議論は、小さくてローカルなスケール(同じアプリ内の2,3のソースコードファイル)に焦点を当てている。
この本では、より大きいデータシステムのレベルでの agility を増加する方法を探索する。
※ 特徴の異なるいくつかの異なるアプリやサービスから構成されるデータシステム
例えば、ツイッターのホームタイムラインをassembleするアーキテクチャーを、方法1から方法2に、どうやってリファクタリングする？

▼
データシステムの修正の容易さや、要件変更への適応の容易さは、シンプルさと抽象化とリンクしている。
シンプルでわかり易いシステムは、複雑なものより修正が容易である。
