▼ データモデル
・どのようにソフトウェアが書かれるかに影響する
・解決しようと考えている問題について、どう考えているかに影響する


■■■■■■■■■■■■■■■■■■■■■■■■■■ データモデルのレイヤー化
ほとんどのアプリケーションは、あるデータモデルを他のデータモデルの上に置くようなレイヤー化をして構築されている。
各レイヤーにおけるキーとなる問い：そのレイヤーは、下位のレイヤーでどのように表現されているか？

1.現実世界のものども(人々、組織、モノ、行動、マネーフロー、センサー)を、OBJ というかたち、またはデータ構造というかたちでモデル化する。
それら構造はしばしばあなたのアプリ固有のものである。

2.データストラクチャを格納したい時、それを下記形式で表現する
・JSON、XML
・RDB のテーブル
・グラフモデル

3.DBソフトウェアを構築したエンジニアが、JSONやテーブル、グラフデータを、
メモリ、ディスク、ネットワーク上で bytes として表現する方法を決める。
その表現によって、データをクエリ、検索、操作、処理する方法が異なってくる。

4.HWや エンジニアがbytesを電気、光、磁気といった形でどう表現するかを決める。

X.複雑なアプリケーションは、もっと中間レベルのものがあるかもしれない
APIの上に構築されたAPIなど。しかし、基本となるアイデアは同じ。
各レイヤーは下位のレイヤーの複雑さを隠して、スッキリしたデータモデルを提供する。
抽象化の結果、DBベンダの開発者や、アプリの開発者が、効率よく協働できる。

■■■■■■■■■■■■■■■■■■■■■■■■■■ データモデルの選定
・データモデルには得手不得手がある。
・一つのデータモデルをマスターするだけでも多くの努力が必要。
・データモデルは、ソフトウェアが何ができて何ができないか、に影響を与えるため、アプリに適切なものを選ぶことが重要
