■■■■■■■■■■■■■■■■■■■■■■■■■■ Replication とは
・同じデータのコピーを、ネットワークで繋がった複数の異なるノード、ロケーションに保持する。
・冗長構成で、あるノードがだめになっても他のノードが使える
・パフォーマンスも良くなる

▼ Replication が使われる理由
・地理的に近い場所のサーバをユーザーが使える →レイテンシーが低くなる
・ディザスタリカバリー。可用性が高い。
・リードクエリを受け付けるマシーンを増やすことで、リードスループットが向上される

■■■■■■■■■■■■■■■■■■■■■■■■■■
▼ 仮定
・データセットが、各マシンがコピーを保持できる程度に小さいものとする


■■■■■■■■■■■■■■■■■■■■■■■■■■
・レプリケートしたデータが更新されないならば、レプリケーションは楽ちんだ。
 →データをすべてのノードにコピーして、出来上がり。

・レプリケーションの困難なところは、レプリケートされたデータへの変更にどう対応するかだ。

▼ 変更をレプリケートするための人気アルゴリズム
single-leader, multi-leader, and leaderless replication.
