■■■■■■■■■■■■■■■■■■■■■■■■■■ Setting Up New Followers
▼ 新フォロワーを追加
なんのため？
・レプリカの数を増やす
・fail したノードを置き換える
課題
▼ 新しいフォロワーがリーダーのデータを正確にコピーできていることをどう保証するのか
・あるノードから他のノードにコピーする、というだけでは不十分
・クライアントは常に書き込みを行っている
 →ただのコピーを行う場合、DBの別の時間の別の場所を見ていたりするので、結果がおかしくなる

・DBロックしてコピーすればいいんじゃね？ →高可用性は犠牲にしたくない。

▼ ダウンタイムなしにフォロワーをセットアップする方法
-------------------------------------------------
1. リーダーDBのスナップショットを取る
※ 可能ならば、DBをロックさせずに。
※ ほとんどの DB にはこの機能がある
※ innobackupex for MySQL みたいなサードパーティツールが必要な場合もある

2. スナップショットを新しいフォロワーノードにコピーする

3. フォロワーがリーダーに接続
 →スナップショット取得後のすべてのデータ変更をリクエストする
これが機能するのに必要なこと
・リーダーのレプリケーションログの正確な位置と、スナップショットとが関連付けられていること
・上記 位置 の名前
PostgreSQL:the log sequence number
MySQL:it the binlog coordinates

4. "we say it has caught up"
フォロワーが、スナップショット以降のデータ変更の処理を完了させたことをそう呼ぶのだそうだ
 →以降は、リーダーの書き込み変更がなされるたびにその更新を取り込む
-------------------------------------------------

▼ フォロワーのセットアップ方法はDBによって異なる
全自動だったり、手動で行う難解なワークフローが必要だったり
