▼ map()
-------------------------------------------------
map(function, iterable, ...)

for loop を書かなくても iterate 処理ができる
-------------------------------------------------

▼ Map 例
-------------------------------------------------
# 関数とリストを定義


def fahrenheit(celsius):
    """引数を別の数値に変換して返す"""
    return (9/5)*celsius + 32

temps = [0, 22.5, 40, 100]

# 第一引数の関数に、第二引数のiterator の要素が一つ一つ渡され、
# 処理された結果が一つ一つ要素となって変数の代入される
F_temps = map(fahrenheit, temps)

#Show
list(F_temps)
-------------------------------------------------



▼ Map で複数の List を受け取る
-------------------------------------------------
a = [1,2,3,4]
b = [5,6,7,8]
# 受け取るIterable の長さが異なる場合、最短インデックスがなくなった段階で処理が止まる
c = [9,10,11]

# x+y+z を計算するアノニマス関数
# 引数は複数のリスト
x_y_z = map(lambda x,y,z:x+y+z,a,b,c)
list(x_y_z)
-------------------------------------------------
