enumerate
forループの中でリスト（配列）などのイテラブルオブジェクトの要素と同時に
インデックス番号（カウント、順番）を取得できる。


▼ リストの値と、ループに伴うカウンターを出力
-------------------------------------------------
for counter, value in enumerate(some_list):
    print(counter, value)
-------------------------------------------------


▼ オプションでインデックスの開始位置を指定
-------------------------------------------------
my_list = ['apple', 'banana', 'grapes', 'pear']
for c, value in enumerate(my_list, 1):
    print(c, value)

# Output:
# 1 apple
# 2 banana
# 3 grapes
# 4 pear
-------------------------------------------------



▼
-------------------------------------------------
for i, name in enumerate(l, 1):
    print('{:03}_{}'.format(i, name))
# 001_Alice
# 002_Bob
# 003_Charlie
-------------------------------------------------



▼
-------------------------------------------------

-------------------------------------------------


▼
-------------------------------------------------

-------------------------------------------------
