■■■■■■■■■■■■■■■■■■■■■■■■■■ Consistent Prefix Reads
▼ 因果関係の異常
ある会話があったとする
-------------------------------------------------
Mr. Poons
How far into the future can you see, Mrs. Cake?
Mrs. Cake
About ten seconds usually, Mr. Poons.
-------------------------------------------------
2つの会話には依存関係がある。
次に、第三者がフォロワーを通してこの会話を聞いていたとする。
で、Mrs. Cake のつぶやきは遅延が小さく、
Mr. Poons のつぶやきは遅延が大きかったとする。
結果、こうなる
-------------------------------------------------
Mrs. Cake
About ten seconds usually, Mr. Poons.
Mr. Poons
How far into the future can you see, Mrs. Cake?
-------------------------------------------------

▼ どんな時によく起こるか
in partitioned (sharded) databases

▼ 解決策：consistent prefix reads
・何を保証するか
一連の書き込みがある順番で行われた場合、それら書き込みを読んだ人は誰もが、同じ順番で書き込みを読むことになること。

・どのように？
もしデータベースが書き込みを常に同じ順番で適用するならば、
読み込み時は常に consistent prefix を読む。
結果、因果関係異常は起きない

 ▼ うまくいかないかもしれないケース
 多くの分散DBは、個々のパーティションは独自に操作を行うため、
 グローバルな書き込みオーダーが存在しない。
 ユーザーが読み込みをする時、古い状態のDBの一部を見るかも知れないし、新しい部分を見ているかも知れない。

▼ 上記の解決策
・互いに因果関係のある書き込みは、同じパーティションに書き込まれる事を保証する。
しかし、
アプリによってはこれを効率的に実現できない。
明示的に因果依存を追跡できるアルゴリズムも存在する。
それは後のチャプターで紹介される。
