■■■■■■■■■■■■■■■■■■■■■■■■■■ Partitioning and Replication
パーティショニングは通常レプリケーションと一緒に行われる。
よって、
各パーティションのコピーは複数のノードに格納される。
これが意味するのは
各レコードは一つのパーティションに属する
けれども同時に
複数の異なるノードにも格納される
for fault tolerance.

ノードは一つ以上のパーティションを格納しているかもしれない。
リーダーフォロワーレプリケーションモデルが使われている場合、
各パーティションのリーダーは一つのノードに割り当てられる。
で、そのフォロワーは他のノードに割り当てられる。
各ノードはあるパーティション所リーダーであり、かつ他のパーティションのフォロワーだったりする。

DBのレプリケーションと同じことが、パーティションのレプリケーションにも当てはまる。
パーティショニングスキーマの選択は、だいたいにおいてレプリケーションスキーマの選択とは独立して行われる。
よって、レプリケーションのことは置いといて、パーティショニングについて語ろうと思う。
