■■■■■■■■■■■■■■■■■■■■■■■■■■ Operations: Automatic or Manual Rebalancing
さて、
リバランシングは自動で起こすのか、手動で起こすのか。

完全自動リバランシング// システムがいつパーティションをあるノードから別のノードに動かすかを自動で決める
と
完全マニュアルリバランシング// アドミンが明示的に、パーティションのノード割当を設定する。アドミンが明示的に再設定した場合のみ、変更がなされる
との間にはグラデーションがある。



▼ 自動でパーティション割当を生成し、提示してくる
 →Couchbase, Riak, and Voldemort
ただし、
アドミンがコミットしないとリバランシングはされない

▼ 完全自動は便利だが、高コストなリバランシングがなされるタイミングが読めない
完全自動はメンテが楽になる。
しかし、リバランシングは高コスト。
リクエストを reroute しないといけないし、
あるノードから別のノードに大量のデータを移さないといけない。

リバランシングは慎重にやらないと、
リバランシング中のパフォーマンスに影響が出る。

▼ 自動リバランシングと自動failure 検知の組み合わせはさらに危険
あるノードの深た高くて一時的にレスポンスが遅くなる
 →他のノードは、上記ノードが死んだと判断する
  →該当ノードをクラスタから除外してリバランスする処理が走る
   →このとき、該当ノードだけでなく、他のノートたち、ネットワークともに追加の負荷がかかる。
    →二次災害が発生しうる。

・・・そんなわけで、自動リバランスよりも、人間が介在している方が良い。
