■■■■■■■■■■■■■■■■■■■■■■■■■■ The Slippery Concept of a Transaction
ほとんどの RDB と、いくつかの RDB以外のデータベースはトランザクションをサポートしている。
ほとんどが、1975 年にIBM が紹介したスタイルや、最初のSQLのスタイルに従っている。
ちいさな変更等はあるが、基本は40年変わっていない。

▼ Rise of NoSQL
2000年台、NoSQL が注目を集め始めた。
彼等は the relational status quo を改善することを目的に登場したような感じで、
新しいデータモデルの選択肢の提示したり、
レプリケーションとパーティショニングをデフォルトで提供している。

NoSQL の興隆の主な原因は、トランザクションだ。
多くの新世代DBがはトランザクションを廃止
または
それまで保証していたものを弱めることで、トランザクションという概念を再定義しようとしている。

・トランザクションは、スケーラビリティに対するアンチテーゼだ。
any large-scale system はトランザクションを廃止して、パフォーマンスと可用性向上させるべきだ。
一方、
“serious applications” with “valuable data” にとっては
トランザクションは必須だと データベースベンダー が主張することもしばしばだ。

どっちも誇張している。
実際はそんなシンプルじゃない。
トランザクションにはトレードオフがある。

トレードオフを知るために、トランザクションが提供する guuarantees の詳細を掘り下げる。
