■■■■■■■■■■■■■■■■■■■■■■■■■■ やること
▼ 現状報告
客先勤務 20名
社内勤務
社内待機者

▼ 営業の話

▼ 近況報告

案件が終わりそうな場合、分かり次第社内連携をお願いします



幹事決める


▼ 売上進捗
・売上の推移
・人員の推移

▼ 連絡事項
12月の部会は両グループが合同で行います


▼ 現場、もしくはプライベートで学んでいること


学習の場について


■■■■■■■■■■■■■■■■■■■■■■■■■■ どうしたいか
営業と各メンバーとが情報を直接交換できる場


Group2 の皆さん

お疲れ様です。柴田です。

11/30(金) の部会は、いつもどおりの近況報告などなどに加え、
みなさんが何に困っているか、何を学んでいるか、学ぼうとしているかを共有する方法を、
みんなでディスカッションしたいと思います。

で、一つの可能性として、Slack を題材にしたいと考えています。

▼ Slack とはなにか
世界中で使われているビジネスチャットアプリケーションみたいのものです

▼ なぜ、そういうことをやろうと思っているか。
・いつもはやらないことをやることで、新しい気づきが起きることに期待したいから
・それぞれの蛸壺で費やされている学習コスト、お悩みコストが、共有することで軽減することに期待したいから

「Slack を使って」というのはマストではないし、非公式だし、待ったが入る可能性もあります。
まあ、そのときはSlackのワークスペースを削除すれば済む話です。

そこでみなさんにお願いがあるのですが、
スマホをお持ちの方は、Slack をインストールしておいていただけると嬉しいです。
※強制ではないです。
※インストールしてないと成り立たない部会にはならないです。

以上、よろしくお願いいたします。










ryota.ichinose@okusystem.co.jp,yumi.yokoyama@okusystem.co.jp,hidemitsu.namba@okusystem.co.jp,masahito.azuma@okusystem.co.jp,hazuki.iwase@okusystem.co.jp,takashi.nakanishi@okusystem.co.jp,kosuke.sakuma@okusystem.co.jp,miki.hasebe@okusystem.co.jp,akiko.nakagawa@okusystem.co.jp,hiroki.nishitani@okusystem.co.jp
