■■■■■■■■■■■■■■■■■■■■■■■■■■ 知識労働におけるゴール
知識労働では、ゴールは曖昧でなければならない
・旅の間、チームの目をチャンスから逸らすことなく、仕事の全体的な方向づけをする
・集中によって得られる成果と、偶然の成果とのバランスを取ること
・チーム全体のゴールと各メンバーのゴールの調整を図ること
・チーム全体として向かうべき方向を示しつつ、各メンバーは直感に従って自由に動ける状態を保つ

■■■■■■■■■■■■■■■■■■■■■■■■■■ 情熱が必須
曖昧なゴールは、やむにやまれぬ感情的な要素が必須

■■■■■■■■■■■■■■■■■■■■■■■■■■ 感覚的な表現で共有
スケッチやラフな模型などを使って、つかみどろろがないアイデアを形として表現する
・ゴールを共有する前に、何らかの方法でそれをわかりやすく定時する必要がある


■■■■■■■■■■■■■■■■■■■■■■■■■■ ゴールはなんだ？
・ゲームの終わりまでに、何を達成したい？
・勝利したときの状況はどういう想定？
・何を手に入れることができる？
▼ 目標は、具体的な形で考えよう
・試作品
・プロジェクトの計画
・さらなる検討を続けるためのアイデアリスト
