■■■■■■■■■■■■■■■■■■■■■■■■■■ Input Output そして目的
▼ Input
要求仕様書、RFP、業務規定・業務ルール等
▼ Output
要件定義書、要求要件追跡書（要求・要件のトレース一覧表）

▼ 本工程の目的
要求がどのようにして要件の形にまとめられていったかをトレースすることで、要求を漏れなく設計に反映させる




■■■■■■■■■■■■■■■■■■■■■■■■■■ step1経営の要求を把握する
▼ 要求一覧表を作成
・まず、要求を把握し、その内容を「要求一覧表」とでも名付けた表にまとめておきます。
経営からのビジネス要求を最優先とします。現場をないがしろにしてはいけませんが、トップダウンの「意思」を優先します。



■■■■■■■■■■■■■■■■■■■■■■■■■■ step2要求の発生源を明確にする
経営上の要求ではない他のビジネス要求について、発生部門および担当者を明確にします。
その際、その要求を満たすことが経営課題の解決につながるものを優先事項としてチェックしておきます。


■■■■■■■■■■■■■■■■■■■■■■■■■■ step3要求の背景にある課題・問題点を明確にする
上記のstep1、step2で把握した要求の背景をきちんと認識し、課題や問題点を明確にしていきます。


■■■■■■■■■■■■■■■■■■■■■■■■■■ step4要求の目的・理由を明確にする
ユーザーが問題としている事柄が、実際には問題（目標と現状のギャップ）ではない場合もあるので、注意が必要です。
あくまで経営課題の解決に資する要求について、原因や理由を明らかにします。


■■■■■■■■■■■■■■■■■■■■■■■■■■ step5要求のランク付け
要求を洗い出した時点で、ひとまず以下の評価基準に照らして、それぞれの重要度合いを5段階にランク付けしていきます。
重要度の高い方から順に5、4、3、2、1の数値を与えます。
・経営およびビジネスに与える影響の大きさ
・緊急度
・課題解決に要する規模など

これらの点を考慮し、総合的なランクを決めていきます。


■■■■■■■■■■■■■■■■■■■■■■■■■■ step6要件とすべき要求を選択する
以下のような要求は、すぐには要件とせず、一旦ユーザーに差し戻します。
①システムで対応すべきではない要求
a.社内の制度的制約、組織的制約、市場的制約
b.社会制度上の制約（法規制、政治的配慮、業界の自主規制ほか）

②システムの対象ではあるが、対応すべきでない要求
a.既に対応中、もしくは対応することにより、対応中の別案件に影響があるもの（特に保守フェーズの場合）
b.規模が大きい、他への影響が大きい、予算がない、納期までに時間がない等制約が大きいもの
※ 但し、「システムの問題ではない」との判断は、安易に下すべきではありません。
特に②bは、技術の進化により対応が容易になったり、金額の大きさ以上に投資効果を見込める場合があったりするので、
最初から切り捨てるつもりで要求に向き合ってはいけません。
制約の中で最大限要求を満たすシステムを作るように心がけましょう。


■■■■■■■■■■■■■■■■■■■■■■■■■■ step7システム要件の確定
▼ 要件定義書に落とし込み
要求としてまとめられた項目について、システムで実現すべき要件を定め、実現へ向けた対応方針を、要件定義書としてまとめていきます。


■■■■■■■■■■■■■■■■■■■■■■■■■■ step8プロジェクトスコーピング
新規開発またはシステム更改（保守フェーズの場合）の対象と機能を明確にします。
この段階では、その時点でわかっている範囲内で構いません。

▼ 新規開発案件の場合
システム全体のイメージと想定しうる機能を明らかにする。

▼ 更改（保守）案件の場合
対象機能とシステム全体への影響を明らかにします。

■■■■■■■■■■■■■■■■■■■■■■■■■■ step9要件を要求に紐付ける
開発範囲を定める際に、どの要求がどのシステム要件で実現されるのか、後々トレースできるよう、一覧表にまとめていきます。

■■■■■■■■■■■■■■■■■■■■■■■■■■ step10要件と成果物の内容を確認する
可能であれば、後々の工程で作成する成果物との間で、要件がどのように実現されたかを確認できるレベルまで、詳細かつ具体的に記載しておきましょう（もちろん後からでも構いません）。
この「後々の工程で作成する成果物」とは、概念データモデル（第3章で詳述）、ToBe業務フローおよび業務プロセスの概要定義（いずれも4章で詳述）等を指しています。











■■■■■■■■■■■■■■■■■■■■■■■■■■
▼ 「要求」＝本当に欲しいもの
・「要求」＝ユーザーが情報システムで実現したいこと
・要求にはまず、大きな「ビジネス要求」があります。

▼ 「要件」＝本当に要るもの
・「要件」＝要求に基づきつつ、制約を踏まえて、情報システムに盛り込むべきもの
・ビジネス要求を実現すべく「ビジネス要件」を整理していきます。
・ユーザーから引き出したビジネス要求に、様々な制約を加味してビジネス要件へと落とし込み、さらにシステム要件となりうるかを検討する。
・もしくは、噴出したシステム要求に対して、同じく制約を加味して、システム要件になりうるかを検討する
※システム要件はビジネス要件のひとつです。

■■■■■■■■■■■■■■■■■■■■■■■■■■ 要求を設計者がトレースする理由
本来、要求分析は設計に先立つ作業ですから、設計者が要求にまで遡って立ち入る余地はないのかもしれません。
しかし、要求に漏れがあると、後々の設計工程において大きな「手戻り」が生じます。
設計の手戻りは、開発プロジェクトの成否を左右するほど大きなダメージを与えます。
そうならないために、システム設計の立場からも、ビジネス要求からシステム要件に至る過程を、再確認しておくことが望まれる
