▼ Input
要求仕様書、RFP、規定、業務ルール、要件定義書、要求要件追跡書など

▼ Output
システム全体図

▼ 本工程の目的
対象となりうるシステムの全体像を把握する


■■■■■■■■■■■■■■■■■■■■■■■■■■ ポイント
・設計対象のシステムは、他のシステムと関連があるのか。あるとするならばどのような関係か。
・設計対象のシステムは、分割した形で管理可能か。可能であれば、どのような管理が可能か。

・まず、設計対象のシステムを図の中心に配置
・次に、関連のある他のシステムを回りに配置した後に矢印で結び、相互の関連の仕方を記述していく。

■■■■■■■■■■■■■■■■■■■■■■■■■■ 他のシステムとの連携がないなんて！！！
もし、他のシステムと全く関連がないという確信がある場合、この作業は不要です。
ただ今日、そのようなシステムはほとんど存在しないと言ってもよいでしょう。
もし、開発予定のシステムがあるのなら、社内でも社外でもよいので、他のシステムとの連携を検討してみましょう。
連携の結果、システムの価値が飛躍的に向上することもあります。
要件についての合意が再度必要になるかもしれませんが、検討する価値は充分にあります。


■■■■■■■■■■■■■■■■■■■■■■■■■■ 対象システムをブレークダウン
次に、設計対象のシステムを、管理可能ないくつかの固まりに分割して表します。
この固まりは、業務上の括りでまとめるのが一般的であり、サブシステム分割の候補となります（詳細は5章）。
現時点では、誰が見てもわかりやすい固まりに“括って”おきましょう。

ラフスケッチのような見取り図で構いませんし、「今、わかっていること」だけで構いませんので、それらを記述してみましょう。
関連のありそうな他のシステムや、サブシステムの候補を書き出していきましょう。
