■■■■■■■■■■■■■■■■■■■■■■■■■■
①要件定義：予算や制約条件の把握、間取りや日照等々の要求の実現性、将来にわたる家族構成等を勘案して、「要件」の形にまとめていきます。





■■■■■■■■■■■■■■■■■■■■■■■■■■
②基本設計：何階建てか・間取り・建物基礎・水まわり・庭・採光・通風・生活動線等の各設計を行い、図面（設計図）やモデル（建物模型）に落とし込んでいきます。
・間取りを決める際にシステムキッチンのスペックが頭に入っていれば、設計の実現性が高まるでしょう。
・システムの基本設計を行う人も、詳細設計の内容（パターンやフレームワーク等）を理解していた方が、良い設計に近づける
・基本設計を行う際には、要件定義の内容を設計図や模型の形に具体化し、当初の要求をどう実現するか、あるいは実現できないかを、施主に説明
・その設計図や模型（モデル）は、施主とのコミュニケーションを可能とし、出来上がりイメージの共有や合意形成に役立つものでなければなりません。
つまり具体的で「わかりやすい」ことが絶対条件
・施主との合意内容は設計書に反映され、詳細設計の工程に引き継がれます。
・設計者が切り替わる場合は特に、詳細設計のインプット情報として漏れがなく、わかりやすい設計書をバトンタッチしなければなりません。
・基本設計では、要件の実現方法や制約等によって断念した事柄を、極力具体的な形で提示する。
 →結果、要求者の理解と合意を得ることができる。
  →また、後工程（詳細設計）の設計者へ向け、設計内容を漏れなく、わかりやすく伝達できる。





■■■■■■■■■■■■■■■■■■■■■■■■■■
③詳細設計：床材・壁紙・建具・配管・配線・キッチンユニット等の部材を決定し、建築工事に着手できるレベルにまで設計を詳細化します。
・詳細設計工程で作られる「詳細設計書」は、施工工事（実装工程）のインプット情報として、職人たちが迷わず作業できるものでなければなりません。
・詳細設計では、実装担当の技術者へ向け、設計内容を漏れなく、わかりやすく伝達する。
