■■■■■■■■■■■■■■■■■■■■■■■■■■ 情報とは
・情報とは、データに、ある意味付けを持たせたもの。
・どのような開発手法を使おうが、
然るべきデータを生成し、参照し、更新し、削除し、意付けした情報を入出力し続けることだけが、情報システムの使命
・意味付けとは、一般的に定義・フォーマット・時間枠・関連性を指す

■■■■■■■■■■■■■■■■■■■■■■■■■■ 設計とは
設計工程でやるべきことは、システムがその使命を果たすための枠組みを検討し、定義していくこと

■■■■■■■■■■■■■■■■■■■■■■■■■■ 情報システム と IT とは違うもの
・情報システムの方は、ITと同じく情報を司りますが、技術ではなく「仕組み」を指し、電子化ではなく「情報化」を組織にもたらします。
・情報システムが扱う「業務」と「データ」をきちんと押さえるべし

■■■■■■■■■■■■■■■■■■■■■■■■■■ 設計のポイント
・工程間のコミュニケーションを円滑にするためにも、わかりやすさこそがポイントとなる。
・成果物は、より少なく、しかしより良く
・最小の労力で、最大の効果を実現する
・物事をシンプルに突き詰めて、厳密な取捨選択を行う

■■■■■■■■■■■■■■■■■■■■■■■■■■ 突き詰めるべきポイント
・データと業務プロセスの交差点
・データと機能の交差点(主に更新処理)


■■■■■■■■■■■■■■■■■■■■■■■■■■ 3つの定義対象
▼ データ


▼ 業務プロセスとそれを実現する機能


▼ データと業務プロセスの交差点、及び、データと機能の交差点
・該当業務プロセス、並びに該当機能が更新するデータのライフサイクルをきちんと管理する
 →つまり、下記2つを定義していく
・更新要領：業務プロセスまたは機能が行うCRUD操作の方法を定義
・更新ロジック：CRUD定義の際に、複雑なロジックを切り出して別途定義
