Group2 の皆さん

お疲れ様です。柴田です。

11/30(金)の「3-12-3ブレインストーム」にご参加いただきありがとうございました。

あの場で生成されたものを、私なりにまとめてみようと思います。

■ テーマ
「学びを共有する」からイメージするもの

■ 各発表内容のざっくりとしたまとめ
・学んだものをアウトプットする場として、SNSや、本の出版や、展示会での発表などがある。
・そもそも、何をどのように学んだらいいか、ということを共有するのも有意義だよね。

■ 感想
今回のエクササイズは、アウトプットそのものよりも、
短い時間に何かを考えて、まとめて、発表するという一連のプロセス事態が面白いと感じました。
テーマ次第で、もっと面白くなるのではないでしょうか。

参加者の皆さんの反応や感想も悪くなかったため、次回も同様の何かを行おうと思います。

ゲームの種類は別のものになるかもしれませんが、
インプットしたものを、処理(取捨選択、トランスフォーム、肥大化)して、アウトプットする
といった大枠は変わらない想定です。

行う機会は月に一度でも、回数を重ねることで、
インプット、処理、アウトプットのスキル的なものがレベルアップしていくのではないでしょうか。
そんなへんてこな小集団ができやしないでしょうか。(という願望)

テーマや進め方については、非公式Slackでいい感じにこねられたらと思います。

※「ゲームストーミングとは何か」について、知ってても知らなくてもどちらでもよいかと思いますが、
昔私がそういう本を買いまして、その中のゲームのうちの一つが「3-12-3ブレインストーム」なのでした。
で、ゲームの数は87なのでした。興味がある人は、ググってください。

以上です
