■■■■■■■■■■■■■■■■■■■■■■■■■■ 用途
・もっと長いゲームに取り組む前の活性剤
・単独で行う準備不要のゲーム
・新しいアイデアを生み出す
・すでにあるアイデアを改善する

■■■■■■■■■■■■■■■■■■■■■■■■■■ 期待したいこと
・短い時間で行うことの価値が感じられるたらいい
・的を射たアイデアは、瞬時に捉えられる
・長々議論しなくても浮かんでくる

■■■■■■■■■■■■■■■■■■■■■■■■■■ 用意するもの
情報カード
サインペン
※ 参加者全員に配る

■■■■■■■■■■■■■■■■■■■■■■■■■■ 進め方
1.ゲームで使うテーマを2語くらいにまとめたものを用意
-------------------------------------------------
例）「エネルギー効率」「未来のテレビ」
・「未来のテレビの機能はどんなものになるか」といった完全な文で表すのは、別の機会に行うほうがよい
・短い要約に集中させ、その特徴や性質を考えさせてから、新しいアイデアや解決策の提案に移るのがよい
-------------------------------------------------


2.時間をはかってゲームを進める
-------------------------------------------------
▼ 1/3 テーマの「特徴や性質」を書き出したカードの山の作成(3分間)
目標：3分間で、できるだけ多くのカードを作る

・参加者は、テーマの特徴や性質について考える
・どんなフィルターもかけずに考える
・思いついたアイデアを、1枚のカードに1アイデア書き出す。
・カードはできるだけ多くつくる
・「名詞 + 動詞」の形で書くと作業速度が上がるかも

▼ 2/3 カードをもとにアイデアを発展させる(12分間)
※ あとで手短に発表するための準備時間です

・各組が集めたカードの山からランダムに「3枚」引く
・具体的なテーマにするために、言葉を補っても良い
・あとで発表できるような組み合わせであれば、作業を始める

・引いたカードをもとに、12分間でアイデアを発展させる
・意見をまとめるときには、スケッチを描いたりするのもいい
・模型を作ってもいい

▼ 3/3 発表 (各組 最長3分ずつ)
・時間厳守
・引いたカードを見せて、そこからなぜ今の内容発表に至ったかを話してもいい

・すべての組の発表が終わったら、明らかになったことについて全体で話し合う
-------------------------------------------------


■■■■■■■■■■■■■■■■■■■■■■■■■■ このゲームの次につづくこと
・一つのアイデアを決める
※投票するとか

・いくつかをひとつにまとめる

・掘り下げ系の別のゲームに引き継ぐ
