■■■■■■■■■■■■■■■■■■■■■■■■■■ APIの作られ方
Webアプリを開発する場合、
サイトが最終的にどんな見た目になるのか、クライアントが予期するためのストーリーとしての、定義されたビジュアルデザインをもとに行う。
と同時に、製品のビジュアルがあることで、クライアントは最終的成果物がどんなによいものになるか、確信を持つことができる。

APIを開発するときはどうだ？
クライアントは同じデザインを送ってくるだろう。
開発側は、そのビジュアルデザインを完結でわかりやすく使い勝手のいいAPIの仕様に翻訳する必要がある。
他の開発者がその製品と遣り取りをするためのUIを構築するためのAPIに翻訳する必要がある。

最終的に多分ステップバイステップでAPIのすべてのエンドポイントを構築し、
（次のエンドポイントのことを考えることなく）もとに戻って、何かをfixし、といったプロセスを繰り返す。

このアプローチの問題は、APIを構築するということは、大きな責任が伴うということだ。
APIはビジネスの心臓部だ。
仕様を尊重しなくてはならない。
エンドポイントに対するあらゆる変更は、あらゆるAPIのフロントエンドの実装にさらなる作業を強いることになるから。
