■■■■■■■■■■■■■■■■■■■■■■■■■■ 柱と柱の間には
トレードオフがある。そこで、ビジネス上の決定がなされ、優先付がなされる。

■■■■■■■■■■■■■■■■■■■■■■■■■■ 信頼性とコスト最適化
-------------------------------------------------
▼ 開発環境
信頼性を犠牲にしてコストを削減


▼ 商用
信頼性を最適化するためにコストをかける
-------------------------------------------------

■ セキュリティと運用上の優秀性
・他の柱とトレードオフになることは通常ない



■■■■■■■■■■■■■■■■■■■■■■■■■■ 運用上の優秀性
-------------------------------------------------
システムを実行およびモニタリングする能力
-------------------------------------------------


■■■■■■■■■■■■■■■■■■■■■■■■■■ セキュリティ
-------------------------------------------------
リスクの評価と軽減戦略によって、
ビジネス価値を生み出しながら、
システム、アセット、情報を保護する能力。
-------------------------------------------------


■■■■■■■■■■■■■■■■■■■■■■■■■■ 信頼性
-------------------------------------------------
・インフラまたはサービスの中断から復旧
・需要に合わせて動的にコンピューティングリソースを取得
・設定ミスや一時的なネットワーク問題のような障害を軽減する
-------------------------------------------------

■■■■■■■■■■■■■■■■■■■■■■■■■■ パフォーマンス効率
-------------------------------------------------
・コンピューティングリソースを効率的に使ってシステム要件を満たす
・需要の変化や技術の進歩に合わせて効率性を維持する
-------------------------------------------------

■■■■■■■■■■■■■■■■■■■■■■■■■■ コスト最適化
-------------------------------------------------

-------------------------------------------------











▼ ベストプラクティスの準拠のため、一つのチームが複数のプロジェクトを横断的にてがけるパターン
-------------------------------------------------
お客様のオンプレミス環境では、
お客様内にテクノロジーアーキテクチャを管理する中心的なチームがある。
ベストプラクティスに従っていることを確実にするために、
他の製品チームや機能チームのオーバーレイとして機能しているケースが多くみられる。
テクノロジーアーキテクチャチームは、多くの場合、
テクニカルアーキテクト (インフラストラクチャ)、
ソリューションアーキテクト (ソフトウェア)、
データアーキテクト、ネットワークアーキテクト、セキュリティアーキテクトなどの
一連のロールで構成されます。
-------------------------------------------------





▼ AWSは、複数のチームに分散させ、かつベストプラクティスを行き渡らせる
-------------------------------------------------
意思決定機関を分散することを選択した場合、
チームが内部の標準を満たしていることを保証できないリスクが発生します

上記への対策
１．各チームにその機能を持たせることに焦点を当てたプラクティス(慣行)がある
・方法、プロセス、標準、および受け入れられている基準

２．基準を確実に満たすための自動チェックを実行するメカニズムを導入
「意志だけでは絶対にうまくいかない。成し遂げるには適切なメカニズムが必要です。」Jeff Bezos
人間の努力に置き換えるメカニズム (多くの場合、自動化) がルールやプロセスに準拠しているか確認する

設計のレビューや AWS ベストプラクティスの理解に役立つサポートを行う
プリンシパルエンジニアの仮想的なコミュニティにアクセスできるようにしています

プリンシパルエンジニアのコミュニティは、ベストプラクティスが参照できアクセスできるようにします


-------------------------------------------------
