



■■■■■■■■■■■■■■■■■■■■■■■■■■ ジョブ
・実際に流すバッチ処理の中身
・単純なシェルスクリプトの他にもLinuxで実行可能なファイルで書けます
・ジョブ実行時に渡す変数
・手動でリトライするときに簡単にできるように設計
例）ID:999の処理を再実行したい場合、コンテナの環境変数にID:999を渡したときに同じ処理を実行できれば再実行しやすい
・テスト環境や本番環境で固有な値(例えばDB接続情報など)あたりも環境変数に登録できると柔軟性が高い

■■■■■■■■■■■■■■■■■■■■■■■■■■ ジョブ定義
・ジョブをどのように実行するのかの定義情報

▼ 下記を定義
・コンテナのリソース(vCPUs、メモリ)
・ジョブとして起動するコンテナイメージ
・実行コマンド
・環境変数
・マウントするボリューム
・コンテナ実行エラー時のリトライ回数

▼ エラー判定
コンテナジョブのゼロ以外の終了コード
Amazon EC2 インスタンスの障害または終了
AWS サービスの内部エラーまたは停止

■■■■■■■■■■■■■■■■■■■■■■■■■■ ジョブキュー
・ジョブが実行されるまで、キューイングする
・Prioritize 可能


■■■■■■■■■■■■■■■■■■■■■■■■■■ スケジューラ
・ジョブキューに接続されていて、キューに入っているジョブを順番にコンピューティング環境にて実行させる
・FIFOに対応
・優先順位1より、優先順位10が先に実行されます。
■■■■■■■■■■■■■■■■■■■■■■■■■■ ジョブ登録
・ジョブ登録時に、ジョブ定義で指定しているいくつかのパラメータを上書き可能
