▼ Dockerとは
・Linux コンテナをもとにしたオープンソースプロジェクト
・Linuxカーネルの、名前空間、コントロールグループを使って、OS上にコンテナを作成
・コンテナ技術は古くからある。なんで Docker が注目されてる？
・ステートレスな環境

▼ コンテナのアーキテクチャ               ここから上がコンテナ
サーバ ＞ ホストOS ＞ Docker エンジン ＞ Bins/Libs > App
■■■■■■■■■■■■ Docker が支持されている理由
▼ 使いやすい
・誰でもラップトップ上にポータブルなアプリをパッケージできる
・パッケージを、パブリック/プライベートクラウド、ベアメタル上で run できる
・マントラは:build once, run anywhere

▼ スピード
・軽い。早い。
・カーネル上で動く箱庭環境に過ぎない。
・使うリソースも fewer
・VM は仮想OSのブートに時間がかかるのに比べて早い
・数秒で Docker コンテナを作成実行できる



▼ Modularity と スケーラビリティー
・Modularity は、システムのコンポーネントの分離、再結合のしやすさの度合い
・アプリの機能を個々のコンテナに分割しやすくしている
・例）ポスグレを一つのコンテナ、Redisサーバを他のコンテナ、Node.js アプリを他のコンテナ
・Docker は個々のコンテナをリンクしやすくしている。
・個々のコンテナのアップデートやスケーリングも簡単
