■■■■■■■■■■■■■■■■■■■■■■■■■■ コンテナ
・Docker Image が classだとしたら、コンテナは Instance みたいな感じ
・コンテナも状態を持たない。immutable
// docker run -it alpine sh
// 上記で Linux システムが構築されるが、
// home ディレクトリ内で ファイル作成しても、exit して再び同じコマンドを打つと、
// home ディレクトリには ファイルがない。




■■■■■■■■■■■■ Dockerコンテナ
・アプリのソフトウェアを、アプリをRUNするために必要なすべてを含めて見えない箱にラップするようなもの
・含まれるもの：OS、アプリのコード、ランタイム、Systemのツール、ライブラリなど
・Docker Image からビルドされる
・DockerImage のリードオンリー ファイルシステムの上に、
  読み書き可能ファイルシステムを追加してコンテナが作成される。
・カーネルなどのブートFS > ベースImage(Debian) > emacs, Apache などの Image > 書込み可能なコンテナ
▼ Docker が コンテナ作成後に行うこと
・NWインターフェイスを作成 ⇒IPアドレスをコンテナに追加
 ⇒コンテナがローカルホストとトークできるようになる。
・Imageを定義するときに指定した、アプリをRUNするためのプロセスを実行する



■■■■■■■■■■■■ コンテナが作成されたらどうなる
どの環境でも、変更を加えることなく RUN できるようになる
