■■■■■■■■■■■■■■■■■■■■■■■■■■ 目的
会議の準備に最適なゲーム
-------------------------------------------------
どのような会議にも計画は必要。
計画は、(臨機応変に調整を行うためのベースとなる)基本原則を決めるのに役立つ。
■■■■■■■■■■■■■■■■■■■■■■■■■■ 戦略
・他の出席者にも会議の企画に参加してもらいましょう
・繰り返し開くうち、会議が独り歩きして、本来の目的からそれてしまうことがあります。

■■■■■■■■■■■■■■■■■■■■■■■■■■ 進め方
下記をチェックリストとして使う


▼ Purpose
-------------------------------------------------
なぜこの会議を開くのか。リーダーはそれを簡潔明瞭に説明できなければならない。
どういう状況なのか。火急の要件はなんなのか。
この問にはっきり答えられないならば、会議が本当に必要なのか自問してみてください。
-------------------------------------------------

▼ Product(成果)
-------------------------------------------------
この会議の具体的な成果として、どのようなアイデアが生み出せるか。
そのアイデアはどんな働きをし、目的達成にどう役立つか。事態をどのように変えうるのか。
-------------------------------------------------

▼ People
-------------------------------------------------
その会議に出席すべきは誰で、どんな役割を演じるのか。
この会議で予想される質問は何か。
その質問に回答すべき人物は誰か。
-------------------------------------------------

▼ Process
-------------------------------------------------
成果としての道具を生み出すために、どのように議題を扱うか。
議題選びは、事前に出席者と協力し会える最大の機会です。
議題を共同で決めれば、相手は必ず出席して、その後も引き続き積極的んい関与してくれるでしょう。
-------------------------------------------------

▼ Pitfalls
-------------------------------------------------
この会議の落とし穴は何で、それにはどう対処したらよいか。
例）ノートパソコンがない。議論の対象外の話題
-------------------------------------------------

▼ Prep
-------------------------------------------------
・事前にやっておくと役立つことは何か。
・あらかじめ目を通しておくべき資料
・事前の調査
・出席者に課すべき宿題
-------------------------------------------------

▼ Practical Concerns(実際的な問題)
-------------------------------------------------
会議の実施計画。
時間と場所。
誰が昼食を持参するかなど。
-------------------------------------------------
