
■■■■■■■■■■■■■■■■■■■■■■■■■■ ユーザー作成
 →ansible ユーザーで ansible をやろうとしたが、
 authrozed_keys が作成されず、ping すらできない状態。
 ssh-add とかすればいい？みたいなのも見るが、よくわからんので断念
 2018/10/08
 https://qiita.com/isaoshimizu/items/84ac5a0b1d42b9d355cf
-------------------------------------------------
// ▼ operation グループを作成
// -------------------------------------------------
// groupadd -g 2000 operation
//
// // getent group operation
// -------------------------------------------------
//
// ▼ ansible ユーザーを作成
// -------------------------------------------------
// useradd -g operation -u 2001 ansible
// usermod -c "execute ansible command to develop infrastructure " ansible
//
// // ユーザーが存在しているか確認
// // getent passwd ansible
// -------------------------------------------------
//
// ▼ 新ユーザーのパスワード変更
// -------------------------------------------------
//  passwd ansible
// -------------------------------------------------
// ▼ ansible ユーザーが sudo を使えるようにする
// -------------------------------------------------
// usermod -G wheel ansible
// grep wheel /etc/group
// -------------------------------------------------
//
// ▼ ユーザー切り替え
// -------------------------------------------------
// su - ansible
// // - は、環境変数を引き継がずに切り替わる
// -------------------------------------------------
